Ran Plan for 2 projects:

1. dir: `meta` workspace: `default`
1. dir: `meta/myfiles` workspace: `default`
---

### 1. dir: `meta` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "classpass-atlantis-poc-6831407"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_object.objects[".terraform.lock.hcl"] will be created
+ resource "aws_s3_object" "objects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "classpass-atlantis-poc-6831407"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "7a9fc9e67c55422b6a5d684eec0057cf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "new_objects"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "myfiles/.terraform.lock.hcl"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.objects["helloworld.html"] will be created
+ resource "aws_s3_object" "objects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "classpass-atlantis-poc-6831407"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "abdcdd1da8cfdd852fd4c2bbeab0dfcc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "new_objects"
      + kms_key_id             = (known after apply)
      + region                 = "us-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "myfiles/helloworld.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d meta
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://latrisha-labile-julianna.ngrok-free.dev/lock?id=classpass%252Fatlantis-example%252Fmeta%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d meta
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `meta/myfiles` workspace: `default`
**Plan Error**
```
running 'sh -c' '/opt/homebrew/bin/terraform plan -input=false -refresh -out "/Users/bay.gaillard/.atlantis/repos/classpass/atlantis-example/1/default/meta/myfiles/default.tfplan"' in '/Users/bay.gaillard/.atlantis/repos/classpass/atlantis-example/1/default/meta/myfiles': exit status 1
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/aws: there is no package for registry.terraform.io/hashicorp/aws 6.27.0 cached in .terraform/providers
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```